cavity/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
     FrontandBacke
    {
        type            empty;
    }
    top
    {
        type            noSlip;
     
    }
    outlet
    {
        type            zeroGradient;


    }
    bottom
    {
        type            noSlip;

    }
    inlet
    {
        type            fixedValue;
        value          uniform (1 0 0);
    }
    diamond
    {
        type            noSlip;
    }
}
}

// ************************************************************************* //
